nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/usb_examples/usb_device_composite_audio_multi_ch_unified/freertos/audio_unified.c
        case USB_DEVICE_AUDIO_FU_SET_RES_TREBLE_CONTROL:
            if (request->isSetup == 1U)
            {
                request->buffer = &g_deviceAudioComposite->audioUnified.resTreble;
                request->length = sizeof(g_deviceAudioComposite->audioUnified.resTreble);
            }
            break;
        case USB_DEVICE_AUDIO_FU_SET_RES_DELAY_CONTROL:
            if (request->isSetup == 1U)
            {
                request->buffer = g_deviceAudioComposite->audioUnified.resDelay;
                request->length = sizeof(g_deviceAudioComposite->audioUnified.resDelay);
            }
            break;
        default:
            error = kStatus_USB_InvalidRequest;
            break;
    }
    return error;
}

/* The USB_AudioSpeakerBufferSpaceUsed() function gets the used speaker ringbuffer size */
uint32_t USB_AudioSpeakerBufferSpaceUsed(void)
{
    uint64_t write_count = 0U;
    uint64_t read_count  = 0U;

    write_count = (uint64_t)((((uint64_t)g_deviceAudioComposite->audioUnified.audioSpeakerWriteDataCount[1]) << 32U) |
                             g_deviceAudioComposite->audioUnified.audioSpeakerWriteDataCount[0]);
    read_count  = (uint64_t)((((uint64_t)g_deviceAudioComposite->audioUnified.audioSpeakerReadDataCount[1]) << 32U) |
                            g_deviceAudioComposite->audioUnified.audioSpeakerReadDataCount[0]);

    if (write_count >= read_count)
    {
        return (uint32_t)(write_count - read_count);
    }
    else
    {
        return 0;
    }
}

/* The USB_AudioSpeakerPutBuffer() function fills the audioRecDataBuff with audioPlayPacket in every callback*/
void USB_AudioSpeakerPutBuffer(uint8_t *buffer, uint32_t size)
{
    uint32_t audioSpeakerPreWriteDataCount = 0U;
    uint32_t remainBufferSpace;
    uint32_t playChannelLength;
    uint8_t *buffer_temp;
    uint8_t fill_zero    = 1U;
    uint8_t channel_data = 0U;

    remainBufferSpace = g_deviceAudioComposite->audioUnified.audioPlayBufferSize - USB_AudioSpeakerBufferSpaceUsed();
    if ((size % (AUDIO_OUT_FORMAT_SIZE * AUDIO_OUT_FORMAT_CHANNELS)) != 0U)
    {
        size = (size / (AUDIO_OUT_FORMAT_SIZE * AUDIO_OUT_FORMAT_CHANNELS)) *
               (AUDIO_OUT_FORMAT_SIZE * AUDIO_OUT_FORMAT_CHANNELS);
    }
    playChannelLength = size / (AUDIO_OUT_FORMAT_CHANNELS / DEMO_TDM_AUDIO_OUTPUT_CHANNEL_COUNT);
    if (playChannelLength > remainBufferSpace) /* discard the overflow data */
    {
        playChannelLength = remainBufferSpace;
    }

    if (playChannelLength <= 0U)
    {
        return;
    }
    for (uint32_t i = 0; i < size; i += (AUDIO_OUT_FORMAT_SIZE * AUDIO_OUT_FORMAT_CHANNELS))
    {
#if (defined(USB_AUDIO_MULTI_CHANNEL_PLAY_SEL) && (0x01 == USB_AUDIO_MULTI_CHANNEL_PLAY_SEL))
        buffer_temp = buffer + i;
#elif (defined(USB_AUDIO_MULTI_CHANNEL_PLAY_SEL) && (0x02 == USB_AUDIO_MULTI_CHANNEL_PLAY_SEL))
        buffer_temp = (buffer + i + AUDIO_OUT_FORMAT_SIZE * 8U);
#endif
        fill_zero    = 1U;
        channel_data = 0U;
        for (uint32_t j = 0; j < (AUDIO_OUT_FORMAT_SIZE * DEMO_TDM_AUDIO_OUTPUT_CHANNEL_COUNT); j++)
        {
            /* make up 32 bits */
            if (1U == fill_zero)
            {
                for (uint8_t k = 0U; k < (4U - AUDIO_OUT_FORMAT_SIZE); k++)
                {
                    audioPlayDataBuff[g_deviceAudioComposite->audioUnified.tdWriteNumberPlay] = 0;
                    g_deviceAudioComposite->audioUnified.tdWriteNumberPlay++;
                    if (g_deviceAudioComposite->audioUnified.tdWriteNumberPlay >=
                        g_deviceAudioComposite->audioUnified.audioPlayBufferSize)
                    {
                        g_deviceAudioComposite->audioUnified.tdWriteNumberPlay = 0;
                    }
                }
                fill_zero = 0;
            }
            audioPlayDataBuff[g_deviceAudioComposite->audioUnified.tdWriteNumberPlay] = *(buffer_temp + j);
            g_deviceAudioComposite->audioUnified.tdWriteNumberPlay++;
            if (g_deviceAudioComposite->audioUnified.tdWriteNumberPlay >=
                g_deviceAudioComposite->audioUnified.audioPlayBufferSize)
            {
                g_deviceAudioComposite->audioUnified.tdWriteNumberPlay = 0;
            }

            if (4U != AUDIO_OUT_FORMAT_SIZE)
            {
                channel_data++;
                if (channel_data == AUDIO_OUT_FORMAT_SIZE)
                {
                    fill_zero    = 1U;
                    channel_data = 0U;
                }
            }
        }
    }
    audioSpeakerPreWriteDataCount = g_composite.audioUnified.audioSpeakerWriteDataCount[0];
    g_composite.audioUnified.audioSpeakerWriteDataCount[0] += size;
    if (audioSpeakerPreWriteDataCount > g_composite.audioUnified.audioSpeakerWriteDataCount[0])
    {
        g_composite.audioUnified.audioSpeakerWriteDataCount[1] += 1U;
    }
}

#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
#else
void USB_DeviceCalculateFeedback(void)
{
    volatile static uint64_t totalFrameValue = 0U;
    volatile static uint32_t frameDistance   = 0U;
    volatile static uint32_t feedbackValue   = 0U;

    uint32_t audioSpeakerUsedSpace = 0U;

    /* feedback interval is AUDIO_CALCULATE_Ff_INTERVAL */
    if (USB_SPEED_HIGH == g_deviceAudioComposite->speed)
    {
#if (USB_DEVICE_CONFIG_AUDIO_CLASS_2_0) /* high speed, feedback interval is AUDIO_CALCULATE_Ff_INTERVAL ms */
        if (g_deviceAudioComposite->audioUnified.speakerIntervalCount !=
            AUDIO_CALCULATE_Ff_INTERVAL *
                (AUDIO_PLAY_BUFFER_SIZE_ONE_FRAME / g_deviceAudioComposite->audioUnified.audioPlayTransferSize))
#else
        if (g_deviceAudioComposite->audioUnified.speakerIntervalCount != AUDIO_CALCULATE_Ff_INTERVAL)
#endif
        {
            g_deviceAudioComposite->audioUnified.speakerIntervalCount++;
            return;
        }
    }
    else /* full speed, feedback interval is AUDIO_CALCULATE_Ff_INTERVAL ms */
    {
        if (g_deviceAudioComposite->audioUnified.speakerIntervalCount != AUDIO_CALCULATE_Ff_INTERVAL)
        {
            g_deviceAudioComposite->audioUnified.speakerIntervalCount++;
            return;
        }
    }

    if (0U == g_deviceAudioComposite->audioUnified.firstCalculateFeedback)
    {
        g_deviceAudioComposite->audioUnified.speakerIntervalCount = 0;
        g_deviceAudioComposite->audioUnified.currentFrameCount    = 0;
        g_deviceAudioComposite->audioUnified.audioSendCount[0]    = 0;
        g_deviceAudioComposite->audioUnified.audioSendCount[1]    = 0;
        totalFrameValue                                           = 0;
        frameDistance                                             = 0;
        feedbackValue                                             = 0;
        USB_DeviceClassGetCurrentFrameCount(CONTROLLER_ID,
                                            (uint32_t *)&g_deviceAudioComposite->audioUnified.lastFrameCount);
#if (USB_DEVICE_CONFIG_AUDIO_CLASS_2_0)
#if (defined(USB_DEVICE_CONFIG_LPCIP3511HS) && (USB_DEVICE_CONFIG_LPCIP3511HS > 0U))
        if (USB_SPEED_HIGH == g_deviceAudioComposite->speed)
        {
            g_deviceAudioComposite->audioUnified.lastFrameCount += s_microFrameCountIp3511HS;
        }
#endif
#endif
        g_deviceAudioComposite->audioUnified.firstCalculateFeedback = 1U;
        return;
    }
    g_deviceAudioComposite->audioUnified.speakerIntervalCount = 0;
    USB_DeviceClassGetCurrentFrameCount(CONTROLLER_ID,
                                        (uint32_t *)&g_deviceAudioComposite->audioUnified.currentFrameCount);
#if (USB_DEVICE_CONFIG_AUDIO_CLASS_2_0)
#if (defined(USB_DEVICE_CONFIG_LPCIP3511HS) && (USB_DEVICE_CONFIG_LPCIP3511HS > 0U))
    if (USB_SPEED_HIGH == g_deviceAudioComposite->speed)
    {
        g_deviceAudioComposite->audioUnified.currentFrameCount += s_microFrameCountIp3511HS;
    }
#endif
#endif
    frameDistance = ((g_deviceAudioComposite->audioUnified.currentFrameCount + USB_DEVICE_MAX_FRAME_COUNT + 1U -
                      g_deviceAudioComposite->audioUnified.lastFrameCount) &
                     USB_DEVICE_MAX_FRAME_COUNT);
    g_deviceAudioComposite->audioUnified.lastFrameCount = g_deviceAudioComposite->audioUnified.currentFrameCount;

    totalFrameValue += frameDistance;

    if (1U == g_deviceAudioComposite->audioUnified.stopFeedbackUpdate)
    {
        return;
    }

    if (1U == g_deviceAudioComposite->audioUnified.feedbackDiscardFlag)
    {
        if (0 != g_deviceAudioComposite->audioUnified.feedbackDiscardTimes)
        {
            g_deviceAudioComposite->audioUnified.feedbackDiscardTimes--;
            if (0 != g_deviceAudioComposite->audioUnified.lastFeedbackValue)
            {
                AUDIO_UPDATE_FEEDBACK_DATA(audioFeedBackBuffer, g_deviceAudioComposite->audioUnified.lastFeedbackValue);
            }
            return;
        }
        else
        {
            g_deviceAudioComposite->audioUnified.feedbackDiscardFlag = 0;
        }
    }

    if (USB_SPEED_HIGH == g_deviceAudioComposite->speed)
    {
        feedbackValue = (uint32_t)((((((uint64_t)g_deviceAudioComposite->audioUnified.audioSendCount[1]) << 32U) |
                                     g_deviceAudioComposite->audioUnified.audioSendCount[0])) *
                                   1024UL * 8UL / totalFrameValue /
                                   (uint64_t)(DEMO_TDM_AUDIO_OUTPUT_CHANNEL_COUNT * DEMO_AUIDO_OUTPUT_FORMAT_SIZE));
    }
    else
    {
        feedbackValue = (uint32_t)((((((uint64_t)g_deviceAudioComposite->audioUnified.audioSendCount[1]) << 32U) |
                                     g_deviceAudioComposite->audioUnified.audioSendCount[0])) *
                                   1024UL / totalFrameValue /
                                   (uint64_t)(DEMO_TDM_AUDIO_OUTPUT_CHANNEL_COUNT * DEMO_AUIDO_OUTPUT_FORMAT_SIZE));
    }

